apple-open-source/macos/IOUSBFamily/AppleUSBOHCI/Classes/AppleUSBOHCI.cpp
	}
	
    // Initialize the Root Hub registers
    if (_errataBits & kErrataDisableOvercurrent)
        _pOHCIRegisters->hcRhDescriptorA |= HostToUSBLong(kOHCIHcRhDescriptorA_NOCP);
        
    // <rdar://problem/5981624> we used to also initialize the Root Hub Status register here. However, the bus might be in
    // operational state reset at this time, so some OHCI implementations may not allow us to write
    // to it, so we will do that after we make the bus state operational instead
    
	return kIOReturnSuccess;
}



IOReturn 
AppleUSBOHCI::UIMInitialize(IOService * provider)
{
    IOReturn				err = kIOReturnSuccess;
    UInt32					lvalue;
    IOPhysicalAddress		hcDoneHead;
	
    USBLog(5,"AppleUSBOHCI[%p]::UIMInitialize", this);
	
     if (!_uimInitialized) 
	{
		_device = OSDynamicCast(IOPCIDevice, provider);
		if(_device == NULL)
			return kIOReturnBadArgument;

        _deviceBase = provider->mapDeviceMemoryWithIndex(0);
        if (!_deviceBase)
        {
            USBError(1,"AppleUSBOHCI[%p]::UIMInitialize unable to get device memory", this);
            return kIOReturnNoMemory;
        }
		
        USBLog(3, "AppleUSBOHCI[%p]::UIMInitialize config @ %x (%x)", this, (uint32_t)_deviceBase->getVirtualAddress(), (uint32_t)_deviceBase->getPhysicalAddress());
		
        SetVendorInfo();
		
        // Set up a filter interrupt source (this process both primary (thru filter function) and secondary (thru action function)
        // interrupts.
        //
        _filterInterruptSource = IOFilterInterruptEventSource::filterInterruptEventSource(this, AppleUSBOHCI::InterruptHandler,	 AppleUSBOHCI::PrimaryInterruptFilter, provider );
		
        if ( !_filterInterruptSource )
        {
			USBError(1,"AppleUSBOHCI[%p]::UIMInitialize unable to get filterInterruptEventSource", this);
            return kIOReturnBadArgument;
        }
        
        err = _workLoop->addEventSource(_filterInterruptSource);
        if ( err != kIOReturnSuccess )
        {
			USBError(1,"AppleUSBOHCI[%p]::UIMInitialize unable to add filter event source: 0x%x", this, err);
            return kIOReturnBadArgument;
        }
		
        /*
         * Initialize my data and the hardware
         */
        _errataBits = GetErrataBits(_vendorID, _deviceID, _revisionID);
		setProperty("Errata", _errataBits, 32);
		
		if (_errataBits & kErrataLucentSuspendResume)
        {
            OSData	*suspendProp;
            UInt32	portBitmap = 0;
            
            // We need to check to see if there are ports that we really should suspend
            //
            suspendProp     = OSDynamicCast(OSData, provider->getProperty( "AAPL,SuspendablePorts" ));
            if (suspendProp)
            {
                // Only allow suspend on certain ports
                //
                portBitmap = *((UInt32 *) suspendProp->getBytesNoCopy());
                _disablePortsBitmap = (0xffffffff & (~portBitmap));
            }
            else
                _disablePortsBitmap = (0xffffffff);
        }
        
        USBLog(5,"AppleUSBOHCI[%p]::UIMInitialize errata bits=0x%x", this, (uint32_t) _errataBits);
		
        _pOHCIRegisters = (OHCIRegistersPtr) _deviceBase->getVirtualAddress();

        // leave bus mastering off until we get the setPowerState
        _device->configWrite16(kIOPCIConfigCommand, kIOPCICommandMemorySpace);
		
        // Set up HCCA.
        _pHCCA = (Ptr) IOMallocContiguous(kHCCAsize, kHCCAalignment, &_hccaPhysAddr);
        if (!_pHCCA)
        {
            USBError(1,"AppleUSBOHCI[%p]::UIMInitialize Unable to allocate memory (2)", this);
            return kIOReturnNoMemory;
        }
		
        _rootHubFuncAddress = 1;
		
        // set up Interrupt transfer tree
        if ((err = IsochronousInitialize()))	return err;
        if ((err = InterruptInitialize()))	return err;
		if ((err = BulkInitialize()))		return err;
        if ((err = ControlInitialize()))	return err;
		
		// <rdar://problem/5981624> this will be done in the setPowerState
		// InitializeOperationalRegisters();
		
        // Work around the Philips part which does weird things when a device is plugged in at boot
        //
        if (_errataBits & kErrataNeedsPortPowerOff)
        {
            USBError(1, "AppleUSBOHCI[%p]::UIMInitialize error, turning off power to ports to clear", this);
            OHCIRootHubPower(0 /* kOff */);
            // No need to turn the power back on here, the reset does that anyway.
        }
        
        // Just so we all start from the same place, reset the OHCI.
        _pOHCIRegisters->hcControl = HostToUSBLong ((kOHCIFunctionalState_Reset << kOHCIHcControl_HCFSPhase));
        IOSync();
		
		// always make sure we stay in reset for at least 50 ms
		IOSleep(50);
		
		// leave the controller in reset until we get the setPowerState
		
		if (_errataBits & kErrataLSHSOpti)
            OptiLSHSFix();
		
		CheckSleepCapability();
		
	}
	_uimInitialized = true;
	_myBusState = kUSBBusStateReset;
   
	return kIOReturnSuccess;
}


IOReturn 
AppleUSBOHCI::UIMFinalize(void)
{
    USBLog (3, "AppleUSBOHCI[%p]::UIMFinalize @ 0x%x (0x%x)(shutting down HW)",this, 
			(uint32_t)_deviceBase->getVirtualAddress(),
			(uint32_t)_deviceBase->getPhysicalAddress());
	
#if 0
	// 4930013: JRH - This is a bad thing to do with shared interrupts, and since we turn off interrupts at the source
	// it should be redundant. Let's stop doing it..
    // Disable the interrupt delivery
    //
    _workLoop->disableAllInterrupts();
#endif
	
    // If we are NOT being terminated, then talk to the OHCI controller and
    // set up all the registers to be off
    //
    if ( !isInactive() )
    {
        // Disable All OHCI Interrupts
        _pOHCIRegisters->hcInterruptDisable = HostToUSBLong(kOHCIHcInterrupt_MIE);
        IOSync();
		
        // Place the USB bus into the Reset State
        _pOHCIRegisters->hcControl = HostToUSBLong((kOHCIFunctionalState_Reset << kOHCIHcControl_HCFSPhase));
        IOSync();
		
		// always make sure we stay in reset for at least 50 ms
        IOSleep(50);
		
